#Like Bundle for Homebrew...
#This sets the default directory for apps installed with Cask to /Applications
#More info here https://caskroom.github.io

cask_args appdir: '/Applications'

#Installs Cask and Homebrew bundle from thier github repos, hence the tap.
tap 'caskroom/cask'
tap 'homebrew/bundle'

#Homebrew Formulaes
brew 'git'
brew 'rvm'
brew 'node'
brew 'tree'
brew 'psql'
brew 'postgresql'
brew 'openssl'
brew 'mysql'
brew 'zsh'


#Cask installs:

cask 'google-chrome'
cask 'google-chrome-canary'
cask 'slack'
cask 'flux'
cask 'firefox'
cask 'sqlitebrowser'
cask 'sql-pro'
cask 'iterm'

